Masmiseim36/nxpSDK/boards/frdmkl82z/project_template/pin_mux.c
/*
 * Copyright 2018 NXP.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v4.1
processor: MKL82Z128xxx7
package_id: MKL82Z128VLK7
mcu_data: ksdk2_0
processor_version: 4.0.0
board: FRDM-KL82Z
pin_labels:
- {pin_num: '26', pin_signal: XTAL32, label: 'Y1[2]/XTAL32_RTC', identifier: XTAL32_RTC}
- {pin_num: '27', pin_signal: EXTAL32, label: 'Y1[1]/EXTAL32_RTC', identifier: EXTAL32_RTC}
- {pin_num: '15', pin_signal: USB0_DM, label: 'J11[2]/USB_DN', identifier: USB_DN}
- {pin_num: '14', pin_signal: USB0_DP, label: 'J11[3]/USB_DP', identifier: USB_DP}
- {pin_num: '42', pin_signal: RESET_b, label: 'J3[6]/J19[10]/J23[3]/RST_TGTMCU_b'}
- {pin_num: '29', pin_signal: TSI0_CH1/PTA0/LPUART0_CTS_b/TPM0_CH5/FXIO0_D10/EMVSIM0_CLK/SWD_CLK, label: 'J19[4]/KL82Z_SWD_CLK'}
- {pin_num: '30', pin_signal: TSI0_CH2/PTA1/LPUART0_RX/FXIO0_D11/EMVSIM0_IO, label: 'J24[3]/J1[11]/BLUETOOTH_UART1_RX/Arduino_SOF_OUT', identifier: BLUETOOTH_UART0_RX}
- {pin_num: '31', pin_signal: TSI0_CH3/PTA2/LPUART0_TX/FXIO0_D12/EMVSIM0_PD, label: 'J1[13]/J24[4]/Arduino_I2S_RX_FS/BLUETOOTH_UART1_TX', identifier: BLUETOOTH_UART0_TX}
- {pin_num: '32', pin_signal: TSI0_CH4/PTA3/LPUART0_RTS_b/TPM0_CH0/FXIO0_D13/EMVSIM0_RST/SWD_DIO, label: 'J7[1]/J19[2]/SWD_DIO_TGTMCU'}
- {pin_num: '33', pin_signal: TSI0_CH5/PTA4/LLWU_P3/TPM0_CH1/FXIO0_D14/EMVSIM0_VCCEN/NMI_b, label: SW2, identifier: SW2}
- {pin_num: '34', pin_signal: PTA14/SPI0_PCS0/LPUART0_TX/FXIO0_D20, label: 'J1[1]/J12[5]/FXIO_D20/VSync/Arduino_I2S_TX_BCLK'}
- {pin_num: '35', pin_signal: PTA15/SPI0_SCK/LPUART0_RX/FXIO0_D21, label: 'J1[3]/J12[7]/Arduino_I2S_TX_FS/FXIO_D21/PCLK'}
- {pin_num: '36', pin_signal: PTA16/SPI0_SOUT/LPUART0_CTS_b/FXIO0_D22, label: 'J1[5]/J12[9]/Arduino_I2S_TXD/FXIO_D22/CAM_D7'}
- {pin_num: '37', pin_signal: PTA17/SPI0_SIN/LPUART0_RTS_b/FXIO0_D23, label: 'J1[7]/J12[11]/Arduino_I2S_MCLK/FXIO_D23/CAM_D5'}
- {pin_num: '40', pin_signal: EXTAL0/PTA18/TPM_CLKIN0, label: 'Y2[3]/EXTAL', identifier: EXTAL12M}
- {pin_num: '41', pin_signal: XTAL0/PTA19/TPM_CLKIN1/LPTMR0_ALT1/LPTMR1_ALT1, label: 'Y2[1]/XTAL', identifier: XTAL12M}
- {pin_num: '43', pin_signal: ADC0_SE8/TSI0_CH0/PTB0/LLWU_P5/I2C0_SCL/TPM1_CH0/FXIO0_D0, label: 'J4[12]/ADC0_SE8/Arduino_A5_ADC0_SE8'}
- {pin_num: '44', pin_signal: ADC0_SE9/TSI0_CH6/PTB1/I2C0_SDA/TPM1_CH1/FXIO0_D1, label: 'J4[10]/ADC0_SE9/Arduino_A4_ADC0_SE9'}
- {pin_num: '45', pin_signal: PTB4/EMVSIM1_IO, label: 'J2[1]/EMVSIM1_IO'}
- {pin_num: '46', pin_signal: PTB5/EMVSIM1_CLK, label: 'J2[3]/EMVSIM1_CLK'}
- {pin_num: '47', pin_signal: PTB6/EMVSIM1_VCCEN, label: 'J2[5]/EMVSIM1_VCCEN'}
- {pin_num: '48', pin_signal: PTB7/EMVSIM1_PD, label: 'J2[7]/EMVSIM1_PD'}
- {pin_num: '49', pin_signal: PTB8/EMVSIM1_RST, label: 'J2[9]/EMVSIM1_RST'}
- {pin_num: '50', pin_signal: PTB11/SPI1_SCK/FXIO0_D5, label: 'J1[15]/J12[15]/Arduino_I2S_RXD/FXIO_D5/CAM_D1'}
- {pin_num: '51', pin_signal: TSI0_CH9/PTB16/SPI1_SOUT/LPUART0_RX/TPM_CLKIN0/EWM_IN, label: 'J1[2]/Arduino_D0_UART0_RX/UART1_RX_TGTMCU', identifier: DEBUG_UART_RX}
- {pin_num: '52', pin_signal: TSI0_CH10/PTB17/SPI1_SIN/LPUART0_TX/TPM_CLKIN1/EWM_OUT_b, label: 'J1[4]/Arduino_D1_UART0_TX/UART1_TX_TGTMCU', identifier: DEBUG_UART_TX}
- {pin_num: '53', pin_signal: TSI0_CH11/PTB18/TPM2_CH0/FXIO0_D6, label: 'E1[1]/TSI_CH11/FXIO_D6', identifier: TSI_ELECTRODE_1}
- {pin_num: '54', pin_signal: TSI0_CH12/PTB19/TPM2_CH1/FXIO0_D7, label: 'E2[1]/TSI_CH12/FXIO_D7', identifier: TSI_ELECTRODE_2}
- {pin_num: '21', pin_signal: ADC0_DP1, label: 'J3[1]/ADC0_DP1'}
- {pin_num: '22', pin_signal: ADC0_DM1, label: 'J3[3]/ADC0_DM1'}
- {pin_num: '23', pin_signal: VREF_OUT/CMP0_IN5/ADC0_SE22, label: 'J3[5]/VREF_OUT'}
- {pin_num: '24', pin_signal: DAC0_OUT/ADC0_SE23, label: 'J4[2]/J4[11]/ADC0_SE23/Arduino_DAC0_OUT'}
- {pin_num: '25', pin_signal: RTC_WAKEUP_B, label: 'J3[7]/RTC_WAKEUP_B'}
- {pin_num: '20', pin_signal: VSSA, label: GND}
- {pin_num: '19', pin_signal: VREFL, label: GND}
- {pin_num: '5', pin_signal: VSS5, label: GND}
- {pin_num: '13', pin_signal: VSS16, label: GND}
- {pin_num: '39', pin_signal: VSS64, label: GND}
- {pin_num: '59', pin_signal: VSS95, label: GND}
- {pin_num: '18', pin_signal: VREFH, label: 'J14[2]/J15[2]/J19[1]/VDD_KL82Z'}
- {pin_num: '28', pin_signal: VBAT, label: 'J3[9]/J14[2]/J15[2]/J19[1]/VDD_KL82Z'}
- {pin_num: '17', pin_signal: VDDA, label: 'J14[2]/J15[2]/J19[1]/VDD_KL82Z'}
- {pin_num: '38', pin_signal: VDD63, label: 'J14[2]/J15[2]/J19[1]/VDD_KL82Z'}
- {pin_num: '60', pin_signal: VDD96, label: 'J14[2]/J15[2]/J19[1]/VDD_KL82Z'}
- {pin_num: '16', pin_signal: USB_VDD, label: 'J14[2]/J15[2]/J19[1]/VDD_KL82Z'}
- {pin_num: '6', pin_signal: VDDIO_E6, label: 'J13[2]/VDDIO_E_1V8'}
- {pin_num: '12', pin_signal: VDDIO_E15, label: 'J13[2]/VDDIO_E_1V8'}
- {pin_num: '55', pin_signal: ADC0_SE14/TSI0_CH13/PTC0/SPI0_PCS4/EXTRG_IN/USB0_SOF_OUT/FXIO0_D12, label: 'J4[6]/ADC0_SE14/Arduino_A2_ADC0_SE14/LEDRGB_BLUE', identifier: LED_BLUE}
- {pin_num: '56', pin_signal: ADC0_SE15/TSI0_CH14/PTC1/LLWU_P6/SPI0_PCS3/LPUART1_RTS_b/TPM0_CH0/FXIO0_D13, label: 'J1[8]/Arduino_D3/Arduino_D3_LED1/LEDRGB_RED', identifier: LED_RED}
- {pin_num: '57', pin_signal: ADC0_SE4b/TSI0_CH15/PTC2/SPI0_PCS2/LPUART1_CTS_b/TPM0_CH1, label: 'J1[12]/Arduino_D5/Arduino_D5_LED2/LEDRGB_GREEN', identifier: LED_GREEN}
- {pin_num: '58', pin_signal: PTC3/LLWU_P7/SPI0_PCS1/LPUART1_RX/TPM0_CH2/CLKOUT, label: 'J1[14]/J12[8]/Arduino_D6/CLKOUT/XCLK'}
- {pin_num: '61', pin_signal: PTC4/LLWU_P8/SPI0_PCS0/LPUART1_TX/TPM0_CH3, label: 'J2[6]/J12[17]/Arduino_D10/Arduino_D10_SPI0_PCS1/Camera Reset'}
- {pin_num: '62', pin_signal: PTC5/LLWU_P9/SPI0_SCK/LPTMR0_ALT2/LPTMR1_ALT2/CMP0_OUT/TPM0_CH2, label: 'J2[12]/J12[18]/Arduino_D13/Arduino_D13_SPI0_SCK/PDWN'}
- {pin_num: '63', pin_signal: CMP0_IN0/PTC6/LLWU_P10/SPI0_SOUT/EXTRG_IN/FXIO0_D14, label: 'J2[8]/J12[13]/Arduino_D11/Arduino_D11_SPI0_SOUT/FXIO_D14/CAM_D3'}
- {pin_num: '64', pin_signal: CMP0_IN1/PTC7/SPI0_SIN/USB0_SOF_OUT/FXIO0_D15, label: 'J2[10]/J12[6]/Arduino_D12/Arduino_D12_SPI0_IN/FXIO_D15/HREF'}
- {pin_num: '65', pin_signal: CMP0_IN2/PTC8/FXIO0_D16, label: 'J1[9]/J12[10]/Arduino_I2S_RX_BCLK/FXIO_D16/CAM_D6'}
- {pin_num: '66', pin_signal: CMP0_IN3/PTC9/FXIO0_D17, label: 'J1[16]/J12[12]/Arduino_D7/FXIO_D17/CAM_D4'}
- {pin_num: '67', pin_signal: PTC10/I2C1_SCL/FXIO0_D18, label: 'J2[20]/J12[14]/ACCEL_I2C_SCL/Arduino_D15/TRACE_SWO/FXIO_D18/CAM_D2'}
- {pin_num: '68', pin_signal: PTC11/LLWU_P11/I2C1_SDA/FXIO0_D19, label: 'J2[18]/J12[16]/ACCEL_I2C_SDA/Arduino_D14/FXIO_D19/CAM_D0'}
- {pin_num: '69', pin_signal: PTC12/TPM_CLKIN0, label: 'J1[10]/J22[3]/Arduino_D4/RF_GPIO_CE'}
- {pin_num: '70', pin_signal: PTC13/TPM_CLKIN1, label: 'U6[11]/INT1_FXOS8700CQ_R/ACCEL_INT1', identifier: ACCEL_INT1}
- {pin_num: '71', pin_signal: PTC16, label: 'J22[8]/RF_IRQ'}
- {pin_num: '72', pin_signal: PTC17, label: 'U12[3]/USB_PWR_FLAG'}
- {pin_num: '73', pin_signal: PTD0/LLWU_P12/SPI0_PCS0/LPUART2_RTS_b/FXIO0_D22, label: SW3, identifier: SW3}
- {pin_num: '74', pin_signal: ADC0_SE5b/PTD1/SPI0_SCK/LPUART2_CTS_b/FXIO0_D23, label: 'J4[4]/ADC0_SE5/Camera_FlexIO'}
- {pin_num: '75', pin_signal: PTD2/LLWU_P13/SPI0_SOUT/LPUART2_RX/I2C0_SCL, label: 'J12[3]/U6[4]/Camera_I2C_SCL/I2C_SCL_FXOS8700CQ', identifier: ACCEL_I2C_SCL}
- {pin_num: '76', pin_signal: PTD3/SPI0_SIN/LPUART2_TX/I2C0_SDA, label: 'J12[4]/U6[6]/I2C0_SDA/Camera_I2C_SDA/I2C_SDA_FXOS8700CQ', identifier: ACCEL_I2C_SDA}
- {pin_num: '77', pin_signal: PTD4/LLWU_P14/SPI0_PCS1/LPUART0_RTS_b/TPM0_CH4/EWM_IN/SPI1_PCS0, label: 'J2[2]/J22[4]/Arduino_D8/RF_SPI1_PCS0'}
- {pin_num: '78', pin_signal: ADC0_SE6b/PTD5/SPI0_PCS2/LPUART0_CTS_b/TPM0_CH5/EWM_OUT_b/SPI1_SCK, label: 'J2[4]/J22[5]/Arduino_D9/RF_SPI1_SCK'}
- {pin_num: '79', pin_signal: ADC0_SE7b/PTD6/LLWU_P15/SPI0_PCS3/LPUART0_RX/SPI1_SOUT, label: 'J4[8]/J22[6]/ADC0_SE7/RF_SPI1_SOUT'}
- {pin_num: '80', pin_signal: PTD7/LPUART0_TX/SPI1_SIN, label: 'J1[6]/J22[7]/Arduino_D2/RF_SPI1_SIN'}
- {pin_num: '1', pin_signal: PTE0/SPI1_PCS1/LPUART1_TX/QSPI0A_DATA3/I2C1_SDA/RTC_CLKOUT, label: 'U11[7]/QSPIA_DATA3', identifier: QSPI0A_DATA3}
- {pin_num: '2', pin_signal: PTE1/LLWU_P0/SPI1_SCK/LPUART1_RX/QSPI0A_SCLK/I2C1_SCL/SPI1_SIN, label: 'U11[6]/QSPIA_SCLK', identifier: QSPI0A_SCLK}
- {pin_num: '3', pin_signal: PTE2/LLWU_P1/SPI1_SOUT/LPUART1_CTS_b/QSPI0A_DATA0/SPI1_SCK, label: 'U11[5]/QSPIA_DATA0', identifier: QSPI0A_DATA0}
- {pin_num: '4', pin_signal: PTE3/SPI1_PCS2/LPUART1_RTS_b/QSPI0A_DATA2/SPI1_SOUT, label: 'U11[3]/QSPIA_DATA2', identifier: QSPI0A_DATA2}
- {pin_num: '7', pin_signal: PTE4/LLWU_P2/SPI1_SIN/QSPI0A_DATA1, label: 'U11[2]/QSPIA_DATA1', identifier: QSPI0A_DATA1}
- {pin_num: '8', pin_signal: PTE5/SPI1_PCS0/QSPI0A_SS0_B/USB0_SOF_OUT, label: 'U11[1]/QSPIA_SS', identifier: QSPI0A_SS}
- {pin_num: '9', pin_signal: PTE7/QSPI0B_SCLK/QSPI0A_SS1_B, label: 'J2[15]'}
- {pin_num: '10', pin_signal: PTE8/QSPI0B_DATA0, label: 'J2[17]'}
- {pin_num: '11', pin_signal: PTE11/QSPI0B_SS0_B/QSPI0A_DQS, label: 'J2[19]/LED3'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

