Masmiseim36/nxpSDK/boards/frdmkl82z/project_template/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitQSPIPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitQSPIPins(void)
{
    /* PTE Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    const port_pin_config_t QSPI0A_DATA3 = {/* Internal pull-up/down resistor is disabled */
                                            kPORT_PullDisable,
                                            /* Fast slew rate is configured */
                                            kPORT_FastSlewRate,
                                            /* Passive filter is disabled */
                                            kPORT_PassiveFilterDisable,
                                            /* Open drain is disabled */
                                            kPORT_OpenDrainDisable,
                                            /* Pin is configured as QSPI0A_DATA3 */
                                            kPORT_MuxAlt5,
                                            /* Pin Control Register fields [15:0] are not locked */
                                            kPORT_UnlockRegister};
    /* PORTE0 (pin 1) is configured as QSPI0A_DATA3 */
    PORT_SetPinConfig(BOARD_QSPI0A_DATA3_PORT, BOARD_QSPI0A_DATA3_PIN, &QSPI0A_DATA3);

    const port_pin_config_t QSPI0A_SCLK = {/* Internal pull-up/down resistor is disabled */
                                           kPORT_PullDisable,
                                           /* Fast slew rate is configured */
                                           kPORT_FastSlewRate,
                                           /* Passive filter is disabled */
                                           kPORT_PassiveFilterDisable,
                                           /* Open drain is disabled */
                                           kPORT_OpenDrainDisable,
                                           /* Pin is configured as QSPI0A_SCLK */
                                           kPORT_MuxAlt5,
                                           /* Pin Control Register fields [15:0] are not locked */
                                           kPORT_UnlockRegister};
    /* PORTE1 (pin 2) is configured as QSPI0A_SCLK */
    PORT_SetPinConfig(BOARD_QSPI0A_SCLK_PORT, BOARD_QSPI0A_SCLK_PIN, &QSPI0A_SCLK);

    const port_pin_config_t QSPI0A_DATA0 = {/* Internal pull-up/down resistor is disabled */
                                            kPORT_PullDisable,
                                            /* Fast slew rate is configured */
                                            kPORT_FastSlewRate,
                                            /* Passive filter is disabled */
                                            kPORT_PassiveFilterDisable,
                                            /* Open drain is disabled */
                                            kPORT_OpenDrainDisable,
                                            /* Pin is configured as QSPI0A_DATA0 */
                                            kPORT_MuxAlt5,
                                            /* Pin Control Register fields [15:0] are not locked */
                                            kPORT_UnlockRegister};
    /* PORTE2 (pin 3) is configured as QSPI0A_DATA0 */
    PORT_SetPinConfig(BOARD_QSPI0A_DATA0_PORT, BOARD_QSPI0A_DATA0_PIN, &QSPI0A_DATA0);

    const port_pin_config_t QSPI0A_DATA2 = {/* Internal pull-up/down resistor is disabled */
                                            kPORT_PullDisable,
                                            /* Fast slew rate is configured */
                                            kPORT_FastSlewRate,
                                            /* Passive filter is disabled */
                                            kPORT_PassiveFilterDisable,
                                            /* Open drain is disabled */
                                            kPORT_OpenDrainDisable,
                                            /* Pin is configured as QSPI0A_DATA2 */
                                            kPORT_MuxAlt5,
                                            /* Pin Control Register fields [15:0] are not locked */
                                            kPORT_UnlockRegister};
    /* PORTE3 (pin 4) is configured as QSPI0A_DATA2 */
    PORT_SetPinConfig(BOARD_QSPI0A_DATA2_PORT, BOARD_QSPI0A_DATA2_PIN, &QSPI0A_DATA2);

    const port_pin_config_t QSPI0A_DATA1 = {/* Internal pull-up/down resistor is disabled */
                                            kPORT_PullDisable,
                                            /* Fast slew rate is configured */
                                            kPORT_FastSlewRate,
                                            /* Passive filter is disabled */
                                            kPORT_PassiveFilterDisable,
                                            /* Open drain is disabled */
                                            kPORT_OpenDrainDisable,
                                            /* Pin is configured as QSPI0A_DATA1 */
                                            kPORT_MuxAlt5,
                                            /* Pin Control Register fields [15:0] are not locked */
                                            kPORT_UnlockRegister};
    /* PORTE4 (pin 7) is configured as QSPI0A_DATA1 */
    PORT_SetPinConfig(BOARD_QSPI0A_DATA1_PORT, BOARD_QSPI0A_DATA1_PIN, &QSPI0A_DATA1);

    const port_pin_config_t QSPI0A_SS = {/* Internal pull-up/down resistor is disabled */
                                         kPORT_PullDisable,
                                         /* Fast slew rate is configured */
                                         kPORT_FastSlewRate,
                                         /* Passive filter is disabled */
                                         kPORT_PassiveFilterDisable,
                                         /* Open drain is disabled */
                                         kPORT_OpenDrainDisable,
                                         /* Pin is configured as QSPI0A_SS0_B */
                                         kPORT_MuxAlt5,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         kPORT_UnlockRegister};
    /* PORTE5 (pin 8) is configured as QSPI0A_SS0_B */
    PORT_SetPinConfig(BOARD_QSPI0A_SS_PORT, BOARD_QSPI0A_SS_PIN, &QSPI0A_SS);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitBLUETOOTHPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '30', peripheral: LPUART0, signal: RX, pin_signal: TSI0_CH2/PTA1/LPUART0_RX/FXIO0_D11/EMVSIM0_IO, slew_rate: fast, open_drain: disable, pull_select: up,
    pull_enable: disable}
  - {pin_num: '31', peripheral: LPUART0, signal: TX, pin_signal: TSI0_CH3/PTA2/LPUART0_TX/FXIO0_D12/EMVSIM0_PD, direction: OUTPUT, slew_rate: fast, open_drain: disable,
    pull_select: up, pull_enable: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

